tap "anomalyco/tap"
tap "gromgit/brewtils"
tap "michel-kraemer/zsh-patina" if OS.mac?
tap "oven-sh/bun"

brew "act"
brew "asciinema"
brew "bash-completion@2"
brew "bash-language-server"
brew "bat"
brew "delta"
brew "direnv"
brew "dust"
brew "entr"
brew "eza" if OS.mac? # Linux: system package via dotbot-unipkg (reads system file metadata)
brew "fd"
brew "fzf"
brew "fzf-tab"
brew "gh"
brew "git-lfs" if OS.mac?
brew "gromgit/brewtils/taproom"
brew "hf"
brew "hyperfine"
brew "jq"
brew "just"
brew "mdformat"
brew "michel-kraemer/zsh-patina/zsh-patina" if OS.mac? # Linux: scripts/install-zsh-patina.sh (tap has no Linux builds)
brew "opencode"
brew "oven-sh/bun/bun"
brew "panache"
brew "pre-commit"
brew "qpdf"
brew "ripgrep"
brew "ruff"
brew "sendme"
brew "shellcheck"
brew "shfmt"
brew "starship"
brew "stylua"
brew "topgrade"
brew "tree-sitter"
brew "tree-sitter-cli"
brew "typst"
brew "uv"
brew "watchexec"
brew "yamlfmt"
brew "yazi"
brew "yq"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zuban"

cask "font-cascadia-code"
cask "font-et-book"
cask "font-hack"
cask "font-inter"
cask "font-latin-modern-math"
cask "font-montaga"
cask "font-selawik"
cask "font-sf-pro" if OS.mac?
cask "font-source-code-pro" if OS.mac? # Linux: scripts/install-source-code-pro.sh
cask "font-symbols-only-nerd-font"
